package com.android.iranname.history

import com.android.iranname.history.model.History

object HistoryItems {
    val pahlavi = History(
        dynasityName = "پهلوی (۱۹۲۶ تا ۱۹۷۹ میلادی)",
        description = "دودمان پهلوی آخرین دودمان پادشاهی ایران " +
                "(۱۳۰۴–۱۳۵۷) است که پس از برچینش دودمان قاجار، در ایران پادشاهی کردند و ایران پهلوی را " +
                "شکل دادند. پایان کار این دودمان مصادف با انقلاب ۱۳۵۷ بود که به جمهوری اسلامی تبدیل شد. "
    )

    val ghajarian = History(
        dynasityName = "قاجاریان (۱۷۹۴ تا ۱۹۲۶ میلادی)",
        description = "ودمان قاجار یا سلسله قاجار یا قاجاریان نام سلسله\u200C" +
                "ای ایرانی است که از حدود" +
                " " +
                "سال ۱۱۷۵ تا ۱۳۰۴[۱] بر ایران قاجاری به مدت حدود صد و سی سال فرمان راندند. بنیان\u200C" +
                "گذار این سلسله آقامحمدخان قاجار بود. سردودمان قاجاریه مربوط به یکی از طایفه\u200C" +
                "های ترکمان ایران به نام ایل قاجار بود که بر اثر یورش مغول از آسیای مرکزی به ایران مهاجرت کردند. آنان ابتدا در پیرامون ارمنستان ساکن شدند." +
                " ایل قاجار یکی از هفت ایل اصلی قزلباش بود که شاه اسماعیل یکم به یاری توان نظامی آن\u200Cها دودمان صفویان را بنیان نهاد[۲][۳][۴][۵][۶] و به دلیل کمک" +
                "\u200Cهای بزرگی که به دربار صفوی می\u200Cنمود، قدرت بیشتری یافت." +
                " شاه عباس بزرگ یک دسته از آنان را در استرآباد (گرگان امروزی) ساکن کرد"
    )

    val zandian = History(
        dynasityName = "زندیان (۱۷۵۰ تا ۱۷۹۴ میلادی)",
        description = "زندیان یا زندیه (۱۱۲۹–۱۱۷۴ ه\u200D" +
                ".ش) دودمان ایرانی حاکم بر ایران بود، که پس از فروپاشی افشاری\u200Cها و تا برآمدن قاجارها به درا" +
                "زای ۴۵ سال در سرزمین ایران حکومت کردند."

    )

    val afsharian = History(
        dynasityName = "افشاریان (۱۷۳۵ تا ۱۷۵۰ میلادی)",
        description = "افشاریان (۱۲۱۰–۱۱۴۸ ه\u200D.ق) یک دودمان تُرک\u200Cتبار ایرانی بود که میانه سده هجدهم میلادی بین سال\u200Cه" +
                "ای ۱۱۱۴ تا ۱۱۲۹ ه\u200D. ش، بر ایران حکومت می\u200Cکرد. این دودمان در سال ۱۷۳۶ م. مصادف با سال" +
                " ۱۱۱۴ ه\u200D.ش توسط نادر و با کشتن دومین شاه هوتکی، اشرف افغان و سپس خلع شاه عباس سوم از سلطنت، بنیان نهاده شد."
    )

    val safavian = History(
        dynasityName = "صفویان (۱۵۰۲ تا ۱۷۳۵ میلادی)",
        description = "صفویان دودمانی ایرانی و شیعه بودند که در سال\u200Cهای ۸۸۰ تا ۱۱۱۴ خورشیدی (برابر ۱۱۴۸–۹۰۷ قمری و ۱۷۳۶–۱۵۰۱ میلادی)  به مدت ۲۳۵ سال بر ایران فرمانروایی کردند. شاهنشاهی صفوی را شاه اسماعیل " +
                "یکم که در سال ۸۸۰ ش-۱۵۰۱\u200Cم در تبریز تاجگذاری کرد، بنیان گذاشت و آخرین شاه صفوی، شاه سلطان حسین بود که در سال ۱۱۰۱ خورشیدی از هوتکیان شکست خورد و بعداً نادرشاه " +
                "افشار در سال ۱۱۱۴ خورشیدی سلسلهٔ صفویان را برانداخت."

    )
}