package com.android.iranname.history

import com.android.iranname.history.model.History

object HistoryItems {
    val pahlavi = History(
        dynasityName = "پهلوی (۱۹۲۶ تا ۱۹۷۹ میلادی)",
        description = "دودمان پهلوی آخرین دودمان پادشاهی ایران " +
                "(۱۳۰۴–۱۳۵۷) است که پس از برچینش دودمان قاجار، در ایران پادشاهی کردند و ایران پهلوی را " +
                "شکل دادند. پایان کار این دودمان مصادف با انقلاب ۱۳۵۷ بود که به جمهوری اسلامی تبدیل شد. "
    )

    val ghajarian = History(
        dynasityName = "قاجاریان (۱۷۹۴ تا ۱۹۲۶ میلادی)",
        description = "دودمان قاجار یا سلسله قاجار یا قاجاریان نام سلسله\u200C" +
                "ای ایرانی است که از حدود" +
                " " +
                "سال ۱۱۷۵ تا ۱۳۰۴ بر ایران قاجاری به مدت حدود صد و سی سال فرمان راندند. بنیان\u200C" +
                "گذار این سلسله آقامحمدخان قاجار بود. سردودمان قاجاریه مربوط به یکی از طایفه\u200C" +
                "های ترکمان ایران به نام ایل قاجار بود که بر اثر یورش مغول از آسیای مرکزی به ایران مهاجرت کردند. آنان ابتدا در پیرامون ارمنستان ساکن شدند." +
                " ایل قاجار یکی از هفت ایل اصلی قزلباش بود که شاه اسماعیل یکم به یاری توان نظامی آن\u200Cها دودمان صفویان را بنیان نهاد و به دلیل کمک" +
                "\u200Cهای بزرگی که به دربار صفوی می\u200Cنمود، قدرت بیشتری یافت." +
                " شاه عباس بزرگ یک دسته از آنان را در استرآباد (گرگان امروزی) ساکن کرد"
    )

    val zandian = History(
        dynasityName = "زندیان (۱۷۵۰ تا ۱۷۹۴ میلادی)",
        description = "زندیان یا زندیه (۱۱۲۹–۱۱۷۴ ه\u200D" +
                ".ش) دودمان ایرانی حاکم بر ایران بود، که پس از فروپاشی افشاری\u200Cها و تا برآمدن قاجارها به درا" +
                "زای ۴۵ سال در سرزمین ایران حکومت کردند."

    )

    val afsharian = History(
        dynasityName = "افشاریان (۱۷۳۵ تا ۱۷۵۰ میلادی)",
        description = "افشاریان (۱۲۱۰–۱۱۴۸ ه\u200D.ق) یک دودمان تُرک\u200Cتبار ایرانی بود که میانه سده هجدهم میلادی بین سال\u200Cه" +
                "ای ۱۱۱۴ تا ۱۱۲۹ ه\u200D. ش، بر ایران حکومت می\u200Cکرد. این دودمان در سال ۱۷۳۶ م. مصادف با سال" +
                " ۱۱۱۴ ه\u200D.ش توسط نادر و با کشتن دومین شاه هوتکی، اشرف افغان و سپس خلع شاه عباس سوم از سلطنت، بنیان نهاده شد."
    )

    val safavian = History(
        dynasityName = "صفویان (۱۵۰۲ تا ۱۷۳۵ میلادی)",
        description = "صفویان دودمانی ایرانی و شیعه بودند که در سال\u200Cهای ۸۸۰ تا ۱۱۱۴ خورشیدی (برابر ۱۱۴۸–۹۰۷ قمری و ۱۷۳۶–۱۵۰۱ میلادی)  به مدت ۲۳۵ سال بر ایران فرمانروایی کردند. شاهنشاهی صفوی را شاه اسماعیل " +
                "یکم که در سال ۸۸۰ ش-۱۵۰۱\u200Cم در تبریز تاجگذاری کرد، بنیان گذاشت و آخرین شاه صفوی، شاه سلطان حسین بود که در سال ۱۱۰۱ خورشیدی از هوتکیان شکست خورد و بعداً نادرشاه " +
                "افشار در سال ۱۱۱۴ خورشیدی سلسلهٔ صفویان را برانداخت."

    )

    val kharazmshahian = History(
        dynasityName = "خوارزمشاهیان (۱۱۵۳ تا ۱۲۳۱ میلادی)",
        description = "خاندان انوشتکین یا خوارزمشاهیان دودمانی تُرک\u200C" +
                "تبار با فرهنگ ترکی-ایرانی و سنی مذهب بود که غلامان ترک آن را بنا نهادند و بر ایران و آسیای میانه حاکم بودند." +
                " خوارزمشاهیان ابتدا به عنوان حکومتی دست\u200Cنشانده از طرف سلطنت سلجوقی بوده و بعد از آن به صورت پادشاهی مستقل حکومت کردند." +
                " بنیانگذار این سلسله، انوشتکین بود که در سال ۱۰۷۷ میلادی ملکشاه سلجوقی او را به عنوان شحنه و حاکم خوارزم منصوب کرد." +
                " فرزندان انوشتکین (تا پیش از ۱۱۵۷ میلادی) به نمایندگی از پادشاهان سلجوقی بر خوارزم حکمرانی می\u200C" +
                "کردند. مورخان قرون وسطی مانند حافظ ابرو و رشیدالدین فضل\u200Cالله همدانی بر این باور بودند که انوشتگین از قبیله بیگدلی از ترکان " +
                "اوغوز است، در حالی که کافسوغلو مورخ ترک می\u200Cگوید انوشتگین از خلج\u200C" +
                "ها یا چگل بود و مورخ باشقیر، زکی ولیدی بر این باور است که آنها از تبار قبچاق\u200Cها، قانگلی یا اویغورها بوده است. وسعت قلمرو این سلسله طبق تخمین ۲٫۳ (یا طبق تخمین دیگر ۳٫۶) میلیون کیلومتر مربع بوده" +
                "\u200Cاست."
    )

    val samanian = History(
        dynasityName = "سامانیان (۸۱۹ تا ۱۰۰۴ میلادی)",
        description = "سامانیان (۸۱۹ میلادی–۹۹۹ میلادی) که با نام\u200Cهای امارت سامانیان یا سلسله سامانیان شناخته می" +
                "\u200Cشوند؛ دودمانی از امرا، ایرانی\u200Cتبار و سنی\u200C" +
                "مذهب بودند که حدود دو قرن بر بخش\u200Cهای بزرگی از ماوراءالنهر با تأیید و مهر خلفای عباسی حکومت کردند. " +
                "مرکز این حکومت خراسان بزرگ و فرارود بود و در بزرگ\u200Cترین گستره\u200Cی خود، بر تمام افغانستان کنونی و بخش" +
                "\u200Cهای بزرگی از کشورهای امروزی تاجیکستان، ایران، ترکمنستان، ازبکستان، قرقیزستان، قزاقستان و پاکستان فرمان راند."
    )

    val sasanian = History(
        dynasityName = "ساسانیان (۲۲۴ تا ۶۵۱ میلادی)",
        description = "شاهنشاهی ساسانی با نام رسمی ایران\u200Cشهر  پایان دورهٔ ایران باستان و واپسین" +
                " شاهنشاهی ایرانی پیش از حمله اعراب به ایران در" +
                " سدهٔ ۷ و ۸ میلادی بود که از سال ۲۲۴ میلادی" +
                " تا ۶۵۱ میلادی به مدت ۴۲۷ سال بر ایران\u200Cشهر فرمان راند؛ شاهنشاهان این دودمان از خاندان ساسان بودند. این شاهنشاهی یکپارچه را اردشیر بابکان با شکست اردوان چهارم،" +
                " واپسین شاهنشاه اشکانی، پایه\u200Cگذاری کرد. شاهنشاهان ساسانی که ریشه\u200Cشان از پارس بود، بر پهنهٔ بزرگی از آسیای غربی چیرگی یافته و در کنار امپراتوری روم-بیزان" +
                "س، در گذر بازهٔ زمان" +
                "ی افزون بر ۴۰۰ سال، ابرقدر" +
                "ت جهان باستان شمرده می\u200Cشدند.[۱۷] پایتخت ایرا" +
                "ن در این دوره، شهر تیسفون در نزدیکی بغداد در عراق امروزی بود. پرچم ایران باستا" +
                "ن در این دوره، درفش کاویانی بود که پس از سرنگونی ساسانیان از میان رفت."   )

    val ashkanian = History(
        dynasityName = "اشکانیان (۲۵۰پیش از میلاد تا ۲۲۶میلادی)",
        description = "شاهنشاهی اشکانی که در ادبیات غرب با نام امپراتوری پارت\u200Cها شناخته م" +
                "ی\u200Cشود، از ۲۴۷ پیش از میلاد تا ۲۲۴ پس از میلاد، دودمانی ایرانی تبار و از مردم سکاها در ایران باس" +
                "تان بودند که ۴۷۱ سال بر قسمت اعظم غرب آسیا و آسیای میانه حکومت می\u200Cکر" +
                "دند. پایه\u200Cگذار دودمان اشکانی، پارتی\u200Cها بودند که در مناطق شمال شرقی ایران ساکن بودند."
    )

    val hakhamaneshian = History(
        dynasityName = "هخامنشیان (۵۵۹ تا ۳۳۰ پیش از میلاد- مدت حکومت ۲۲۹ سال)",
        description = "شاهنشاهی هخامنشی یا امپراتوری پارس (۵۵۰–۳۳۰ پیش از میلاد) یک پادشاهی " +
                "باستانی ایرانی در باختر آسیا بود که توسط کوروش بزرگ در سال ۵۵۰ پیش از میلاد بنیان" +
                "\u200Cگذاری شد. در دوران خشایارشا یکم به بزرگ\u200Cترین گسترهٔ خود رسید که از بالکان و اروپای شرقی در باختر، تا دره سند در خاور " +
                "امتداد داشت. این شاهنشاهی بزرگ\u200Cترین امپراتوری جهان تا بدان روز بود و" +
                " در مجموع ۵٫۵ میلیون کیلومتر مربع (۲٫۱ میلیون مایل مربع) گسترهٔ داشت." +
                " همچنین این شاهنشاهی نخستین ابرقدرت جهان نیز بود که نهایتاً در پی " +
                "حمله اسکندر مقدونی به ایران سرنگون شد و از بین رفت."
    )

    val mad = History(
        dynasityName = "پادشاهی ماد (از ح۷۰۰ تا ح۵۵۰ پیش از میلاد)",
        description = "حکومتی ایرانی بود که در سده\u200Cهای میانی هزارهٔ یکم پ.م.، از حدود ۶۷۸ پ.م." +
                " تا حدود ۵۴۹ پ.م. ابتدا صرفاً در ناحیه سکونت مادها در شمال" +
                " غربی ایران و سپس بر بیشتر فلات ایران حکمرانی می\u200Cکرد."
    )
}